Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalSupportCycleWarning Property
 Circular support chain detected
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalSupportCycleWarning { get; }
Public Shared ReadOnly Property AnalyticalSupportCycleWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalSupportCycleWarning {
	FailureDefinitionId^ get ();
}
static member AnalyticalSupportCycleWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace